-- 회원 약관 항목 생성문 
INSERT INTO service_user_condition (cond_code, name, short_exp, long_exp, chk_use, law1, law2, law3, comt, reg_date, reg_user_seq, up_date, up_user_seq)
VALUES
    ('SUV0001', '서비스 이용약관', '서비스 사용 시 필요한 기본 약관입니다.', '이 약관은 서비스를 사용하는 과정에서 회원과 회사 간의 권리 및 의무, 책임 사항을 규정합니다. 주요 내용은 회원의 의무, 회사의 책임, 서비스 사용 제한 조건 등이 포함됩니다.', 'Y', '개인정보 보호법', '전자상거래법', '소비자보호법', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0002', '개인정보 수집 및 이용', '회원의 개인정보 수집과 사용에 관한 약관입니다.', '이 약관은 회사가 회원의 개인정보를 어떻게 수집, 저장, 관리, 이용하는지를 규정합니다. 수집 항목, 이용 목적, 보관 기간, 제3자 제공 여부 등이 포함됩니다.', 'Y', '정보통신망법', '개인정보 보호법', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0003', '위치정보 이용에 대한 동의', '위치 기반 서비스를 위한 약관입니다.', '위치 기반 서비스를 제공하기 위해 회원의 위치 정보를 수집 및 이용하는 방법과 범위에 대해 설명합니다. 구체적으로는 위치 정보 제공 동의, 활용 목적, 데이터 보관 기간 등이 포함됩니다.', 'Y', '위치정보법', '없음', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0004', '쿠키 사용 약관', '쿠키와 관련된 약관입니다.', '회사는 웹사이트의 서비스 개선과 사용자 경험 향상을 위해 쿠키를 사용합니다. 쿠키의 저장 방식, 목적, 사용자의 쿠키 설정 방법 및 삭제 방법에 대해 자세히 설명합니다.', 'Y', '정보통신망법', '개인정보 보호법', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0005', '마케팅 정보 수신 동의', '마케팅 정보 제공 관련 약관입니다.', '회원에게 이메일, 문자 메시지, 푸시 알림 등을 통해 마케팅 정보를 제공하는 약관입니다. 수신 동의 여부, 철회 방법, 제공 내용 등이 포함됩니다.', 'Y', '개인정보 보호법', '광고법', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0006', '제3자 제공 동의', '제3자에게 정보 제공 시 필요한 약관입니다.', '회원의 개인정보를 제3자에게 제공할 때 필요한 동의 절차와 제공 범위를 설명합니다. 제공되는 정보, 대상, 제공 목적, 회원의 동의 철회 방법 등이 포함됩니다.', 'Y',  '개인정보 보호법', '없음', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0007', '회원 탈퇴 약관', '회원 탈퇴 절차를 안내하는 약관입니다.', '회원 탈퇴 시 적용되는 약관으로, 탈퇴 요청 방법, 데이터 보관 및 삭제 정책, 탈퇴 후 서비스 제한 사항 등을 규정합니다.', 'Y', '정보통신망법', '개인정보 보호법', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1),
    ('SUV0008', '서비스 변경 약관', '서비스 변경 시 적용되는 약관입니다.', '서비스 정책 변경, 기능 추가 또는 종료 등과 관련하여 회원에게 고지하는 방법과 회원의 권리 및 의무를 규정합니다.', 'Y', '정보통신망법', '없음', '없음', '...', CURRENT_DATE, 1, CURRENT_DATE, 1);
