-- 내용 확인
SELECT *
FROM service_rule_use;

-- 삭제
DELETE
FROM service_rule_use;

INSERT INTO service_rule_use
(
    rule_stat, name, tar_name,
    op1, op2, op3,
    val1, val2, val3,
    val4, val5, chk_use,
    reg_date, reg_user_seq, up_date,
    up_user_seq, code
)
VALUES
-- 회원 제재 활동 규칙
(
    'SA0001', '[제재활동 규칙] 출신지 차별 발언 횟수 제한', 'orig_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0002', '[제재활동 규칙] 외모 차별 발언 횟수 제한', 'phys_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0003', '[제재활동 규칙] 정치 성향 차별 발언 횟수 제한', 'poli_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0004', '[제재활동 규칙] 혐오 욕설 발언 횟수 제한', 'prof_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0005', '[제재활동 규칙] 연령 차별 발언 횟수 제한', 'age_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0006', '[제재활동 규칙] 인종 차별 발언 횟수 제한', 'race_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0007', '[제재활동 규칙] 종교 차별 발언 횟수 제한', 'reli_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
(
    'SA0008', '[제재활동 규칙] 인종 차별 발언 횟수 제한', 'race_cnt',
    '>=', '>', '=',
    '3', '5', '8',
    '10', '15', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2001'
),
-- 회원 등급 관련 규칙
(
    'GA0001', '[회원등급 규칙] 브론즈 - 게시글 작성 횟수', 'tot_boar_cnt',
    '<', '<=', '=',
    '100', '150', '200',
    '250', '300', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0002', '[회원등급 규칙] 브론즈 - 좋아요 받은 횟수', 'tot_like_cnt',
    '<', '<=', '=',
    '50', '100', '150',
    '200', '250', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0003', '[회원등급 규칙] 브론즈 - 베스트 등록 횟수', 'tot_best_cnt',
    '<', '<=', '=',
    '10', '15', '20',
    '25', '30', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),

(
    'GA0004', '[회원등급 규칙] 실버 - 게시글 작성 횟수', 'tot_boar_cnt',
    '>=', '>', '=',
    '100', '150', '200',
    '250', '300', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0005', '[회원등급 규칙] 실버 - 좋아요 받은 횟수', 'tot_like_cnt',
    '>=', '>', '=',
    '50', '100', '150',
    '200', '250', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0006', '[회원등급 규칙] 실버 - 베스트 등록 횟수', 'tot_best_cnt',
    '>=', '>', '=',
    '10', '15', '20',
    '25', '30', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),

(
    'GA0007', '[회원등급 규칙] 골드 - 게시글 작성 횟수', 'tot_boar_cnt',
    '>=', '>', '=',
    '200', '250', '300',
    '350', '400', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0008', '[회원등급 규칙] 골드 - 좋아요 받은 횟수', 'tot_like_cnt',
    '>=', '>', '=',
    '200', '250', '300',
    '350', '400', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0009', '[회원등급 규칙] 골드 - 베스트 등록 횟수', 'tot_best_cnt',
    '>=', '>', '=',
    '20', '25', '30',
    '35', '40', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),

(
    'GA0010', '[회원등급 규칙] 플래티넘 - 게시글 작성 횟수', 'tot_boar_cnt',
    '>=', '>', '=',
    '400', '450', '500',
    '550', '600', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0011', '[회원등급 규칙] 플래티넘 - 좋아요 받은 횟수', 'tot_like_cnt',
    '>=', '>', '=',
    '400', '450', '500',
    '550', '600', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0012', '[회원등급 규칙] 플래티넘 - 베스트 등록 횟수', 'tot_best_cnt',
    '>=', '>', '=',
    '40', '45', '50',
    '55', '60', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),

(
    'GA0013', '[회원등급 규칙] 다이아 - 게시글 작성 횟수', 'tot_boar_cnt',
    '>=', '>', '=',
    '800', '850', '900',
    '950', '1000', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0014', '[회원등급 규칙] 다이아 - 좋아요 받은 횟수', 'tot_like_cnt',
    '>=', '>', '=',
    '800', '850', '900',
    '950', '1000', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0015', '[회원등급 규칙] 다이아 - 베스트 등록 횟수', 'tot_best_cnt',
    '>=', '>', '=',
    '80', '85', '90',
    '95', '100', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),

(
    'GA0016', '[회원등급 규칙] 마스터 - 게시글 작성 횟수', 'tot_boar_cnt',
    '>=', '>', '=',
    '1000', '1100', '1200',
    '1300', '1400', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0017', '[회원등급 규칙] 마스터 - 좋아요 받은 횟수', 'tot_like_cnt',
    '>=', '>', '=',
    '1000', '1100', '1200',
    '1300', '1400', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
),
(
    'GA0018', '[회원등급 규칙] 마스터 - 베스트 등록 횟수', 'tot_best_cnt',
    '>=', '>', '=',
    '100', '110', '120',
    '130', '140', 'Y',
    CURRENT_DATE, 1, CURRENT_DATE,
    1, '2002'
);